БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПредопреленныеФункцииШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеНазначенияШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазначениеШаблона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Объект.Предопределенный; 
	
	ЗаполнитьДоступныеНазначения();
	
КонецПроцедуры     

&НаСервере
Процедура ЗаполнитьДоступныеНазначения()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоступныеНазначенияШаблонов.НазначениеШаблона КАК НазначениеШаблона
	               |ИЗ
	               |	Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.ДоступныеНазначенияШаблонов КАК ДоступныеНазначенияШаблонов
	               |ГДЕ
	               |	ДоступныеНазначенияШаблонов.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивДоступных = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НазначениеШаблона");

	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_НазначенияШаблоновДокументов.Тип.Типы();
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);   
		Пометка = МассивДоступных.Найти(ИдентификаторОбъектаМетаданных) <> Неопределено;
		СписокНазначенийШаблонов.Добавить(ИдентификаторОбъектаМетаданных, ИдентификаторОбъектаМетаданных.Синоним,Пометка);
	КонецЦикла;                         
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДоступныеНазначенияШаблонов.Очистить();
	
	Для Каждого ЭлементСписка из СписокНазначенийШаблонов Цикл
		Если Не ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТекущийОбъект.ДоступныеНазначенияШаблонов.Добавить();
		НоваяСтрока.НазначениеШаблона = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ИдентификаторФункции = ИдентификаторПоПредставлению();
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьИдентификатор(Команда)
	Объект.ИдентификаторФункции = ИдентификаторПоПредставлению();
КонецПроцедуры

&НаСервере
Функция ИдентификаторПоПредставлению()
	
	Идентификатор	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПоТексту(СокрЛП(Объект.Наименование));
	
	КодУникальности = 0;
	ПолучитьУникальностьИдетификатора(Идентификатор, КодУникальности, Объект.Ссылка);

	Идентификатор = Идентификатор + Формат(КодУникальности, "ЧН=' '; ЧГ=0");
	
	Возврат СокрЛП(Идентификатор);
	
КонецФункции 

&НаСервере
Процедура ПолучитьУникальностьИдетификатора(Знач Идентификатор, КодУникальности, ТекущаяСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПредопреленныеФункцииШаблоновДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПредопреленныеФункцииШаблоновДокументов КАК CW_ПредопреленныеФункцииШаблоновДокументов
	               |ГДЕ
	               |	CW_ПредопреленныеФункцииШаблоновДокументов.Ссылка <> &Ссылка";   
	
	Запрос.УстановитьПараметр("Ссылка", 			ТекущаяСсылка);
	Запрос.УстановитьПараметр("НазначениеШаблона", 	Объект.НазначениеШаблона);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КодУникальности = КодУникальности + 1;  
	Идентификатор 	= Идентификатор + Формат(КодУникальности, "ЧГ=0");
	
	ПолучитьУникальностьИдетификатора(Идентификатор, КодУникальности, ТекущаяСсылка);
	
КонецПроцедуры
